Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
#include <ArduinoJson.h>
#include <EEPROM.h>
#include <ESP8266HTTPClient.h>
#include <ESP8266WiFi.h>
#include <WiFiClientSecure.h>
#include <WiFiUdp.h>
#include "DS3231.h"            // Чип RTC
#include "GBasic.h"            // DRV8825
#include "RtcDS3231.h"         // Время
#include "Shiftduino.h"        // Сдвиговый регистр
#include "TimeAlarms.h"        // Таймеры
#include "uptime_formatter.h"  // Время работы
//// Сдвиговый регистр
#define dataPin 10
#define clockPin 14
#define latchPin 16
#define countShiftRegister 4  // Кол-во сдвиговых регистров
Shiftduino shiftRegister(dataPin, clockPin, latchPin, countShiftRegister);

//// PROGMEM
const char contentType[] PROGMEM = {"Content-Type"};
const char applicationJson[] PROGMEM = {"application/json"};
const char androidTickerText[] PROGMEM = {"android-ticker-text"};
const char androidContentTitle[] PROGMEM = {"android-content-title"};
const char androidContentText[] PROGMEM = {"android-content-text"};

const char urlLights[] PROGMEM = {
    "https://api.backendless.com/2B9D61E8-C989-5520-FFEB-A720A49C0C00/078C7D14-D7FF-42E1-95FA-A012EB826621/data/"
    "Light?property=enabled&property=name&property=off&property=on&property=pin&property=state"};
const char urlDosers[] PROGMEM = {
    "https://api.backendless.com/2B9D61E8-C989-5520-FFEB-A720A49C0C00/078C7D14-D7FF-42E1-95FA-A012EB826621/data/"
    "Doser?property=dirPin&property=enablePin&property=index&property=mode0_pin&property=mode1_pin&property=mode2_pin&property="
    "name&property=sleepPin&property=stepPin&property=steps&property=time&property=volume"};
const char urlCompressor[] PROGMEM = {
    "https://api.backendless.com/2B9D61E8-C989-5520-FFEB-A720A49C0C00/078C7D14-D7FF-42E1-95FA-A012EB826621/data/"
    "Compressor?property=enabled&property=off&property=on&property=pin&property=state"};
const char urlPutUptime[] PROGMEM = {
    "https://api.backendless.com/2B9D61E8-C989-5520-FFEB-A720A49C0C00/078C7D14-D7FF-42E1-95FA-A012EB826621/data/Uptime/"
    "66E232A0-EFF0-4A9C-9B6A-785C85B139B7"};
const char urlPutLastOnline[] PROGMEM = {
    "https://api.backendless.com/2B9D61E8-C989-5520-FFEB-A720A49C0C00/078C7D14-D7FF-42E1-95FA-A012EB826621/data/LastOnline/"
    "E190FD47-1611-41CF-A1A6-C852EC05BD4F"};
const char urlPostBoot[] PROGMEM = {
    "https://api.backendless.com/2B9D61E8-C989-5520-FFEB-A720A49C0C00/078C7D14-D7FF-42E1-95FA-A012EB826621/data/BootHistory"};
const char urlPushMessage[] PROGMEM = {
    "https://api.backendless.com/2B9D61E8-C989-5520-FFEB-A720A49C0C00/078C7D14-D7FF-42E1-95FA-A012EB826621/messaging/Default"};
const char urlPutLight[] PROGMEM = {
    "https://api.backendless.com/2B9D61E8-C989-5520-FFEB-A720A49C0C00/078C7D14-D7FF-42E1-95FA-A012EB826621/data/"
    "Light?where=name%3D'"};
const char urlPutCompressor[] PROGMEM = {
    "https://api.backendless.com/2B9D61E8-C989-5520-FFEB-A720A49C0C00/078C7D14-D7FF-42E1-95FA-A012EB826621/data/Compressor/"
    "CB8B3EC7-2C05-4D0B-99BE-DE276D98DBDF"};
//// RTC
DS3231 clockRTC;
RtcDS3231 rtc;
IPAddress timeServerIP;

//// Time Synchronization
const char* ntpServerName = "pool.ntp.org";
const int NTP_PACKET_SIZE = 48;
byte packetBuffer[NTP_PACKET_SIZE];
byte count_sync = 0;
WiFiUDP udp;

//// WIFI
#define WORK_DEF1
#ifdef WORK_DEF
#define WIFI_SSID "Wi-Fi"
#define WIFI_PASSWORD "1357924680"
#define WIFI_RETRY 50
#else
#define WIFI_SSID "MikroTik"
#define WIFI_PASSWORD "11111111"
#define WIFI_RETRY 10
#endif
uint8_t wifiMaxTry = WIFI_RETRY;  //Попытки подключения к сети
uint8_t wifiConnectCount = 0;
const char* WiFi_hostname = "ESP8266";

//// HTTPS
std::unique_ptr<BearSSL::WiFiClientSecure> client(new BearSSL::WiFiClientSecure);
HTTPClient https;
String responseString = "";

//// DEVICES
//Аэратор
ledDescription_t compressor;

//Дозаторы
doser_t dosersArray[3];
std::unique_ptr<GBasic> doserK{};
std::unique_ptr<GBasic> doserNP{};
std::unique_ptr<GBasic> doserFe{};

// Прожекторы
ledDescription_t leds[6];
std::vector<std::reference_wrapper<ledDescription_t>> vectorRefLeds;
typedef Iterator<ledPosition, ledPosition::ONE, ledPosition::SIX> ledPositionIterator;
typedef Iterator<doserType, doserType::K, doserType::Fe> doserTypeIterator;

//// METHODS
void delPtr(const char* p) {
    delete[] p;
}

char* newPtr(size_t len) {
    char* p = new char[len];
    memset(p, 0, len);
    return p;
}

char* getPGMString(PGM_P pgm) {
    size_t len = strlen_P(pgm) + 1;
    char* buf = newPtr(len);
    strcpy_P(buf, pgm);
    buf[len - 1] = 0;
    return buf;
}

void sendMessage(const String& message) {
    char* url = nullptr;
    url = getPGMString(urlPushMessage);
    if (https.begin(*client, String(url))) {
        String data;
        data = "{\"message\":\"" + message + "\"}";
        https.addHeader(String(getPGMString(contentType)), String(getPGMString(applicationJson)));
        https.addHeader(String(getPGMString(androidTickerText)), F("You just got a push notification!"));
        https.addHeader(String(getPGMString(androidContentTitle)), F("This is a notification title"));
        https.addHeader(String(getPGMString(androidContentText)), F("Push Notifications are cool"));

        int httpCode = https.POST(data);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.println(F("Сообщение отправлено"));
        } else {
            Serial.printf_P(PSTR("sendMessage() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "sendMessage() -> Невозможно подключиться\n");
    }
    delPtr(url);
}

void sendMessage(ledDescription_t& led, bool state) {
    char dataMsg[100];
    String stateString = state ? "Включение" : "Выключение";
    char* p = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    sprintf(dataMsg, "Прожектор %s в %s", led.name.c_str(), String(p).c_str());
    delPtr(p);

    char* url = nullptr;
    url = getPGMString(urlPushMessage);
    if (https.begin(*client, String(url))) {
        String data;
        data = "{\"message\":\"" + stateString + "\"}";
        https.addHeader(String(getPGMString(contentType)), String(getPGMString(applicationJson)));
        https.addHeader(String(getPGMString(androidTickerText)), F("You just got a push notification!"));
        https.addHeader(String(getPGMString(androidContentTitle)), F("This is a notification title"));
        https.addHeader(String(getPGMString(androidContentText)), String(dataMsg));

