Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
        int httpCode = https.POST(data);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.println(F("Сообщение отправлено"));
        } else {
            Serial.printf_P(PSTR("sendMessage() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "sendMessage() -> Невозможно подключиться\n");
    }
    delPtr(url);
    stateString.clear();
}

void ledOnHandler(ledDescription_t& led) {
    if (led.led.enabled) {
        Serial.printf_P(PSTR("  Включение прожектора PIN %d\n"), led.led.pin);
        shiftRegister.setPin(countShiftRegister, led.led.pin, HIGH);
        sendMessage(led, true);
        Alarm.enable(led.led.off);
        Alarm.enable(led.led.on);
        led.led.currentState = true;

        vectorRefLeds.push_back(led);
    } else {
        Serial.printf_P(PSTR("%s\n"), "Прожектор не доступен для изменения состояния");
        Alarm.disable(led.led.off);
        Alarm.disable(led.led.on);
    }
}

void ledOffHandler(ledDescription_t& led) {
    if (led.led.enabled) {
        Serial.printf_P(PSTR("  Выключение прожектора PIN %d\n"), led.led.pin);
        shiftRegister.setPin(countShiftRegister, led.led.pin, LOW);
        sendMessage(led, false);
        Alarm.enable(led.led.off);
        Alarm.enable(led.led.on);
        led.led.currentState = false;

        vectorRefLeds.push_back(led);
    } else {
        Serial.printf_P(PSTR("%s\n"), "Прожектор не доступен для изменения состояния");
        Alarm.disable(led.led.off);
        Alarm.disable(led.led.on);
    }
}

void compressorOnHandler(ledDescription_t& led) {
    if (led.led.enabled) {
        Serial.printf_P(PSTR("  Включение компрессора PIN %d\n"), led.led.pin);
        shiftRegister.setPin(countShiftRegister, led.led.pin, HIGH);
        sendMessage(led, true);  // отправка события о включении компрессора
        Alarm.enable(led.led.off);
        Alarm.enable(led.led.on);
        led.led.currentState = true;

        vectorRefLeds.push_back(led);
    } else {
        Serial.printf_P(PSTR("%s\n"), "Компрессор не доступен для изменения состояния");
        Alarm.disable(led.led.off);
        Alarm.disable(led.led.on);
    }
}

void compressorOffHandler(ledDescription_t& led) {
    if (led.led.enabled) {
        Serial.printf_P(PSTR("  Выключение компрессора PIN %d\n"), led.led.pin);
        shiftRegister.setPin(countShiftRegister, led.led.pin, LOW);
        sendMessage(led, false);  // отправка события о выключении компрессора
        Alarm.enable(led.led.off);
        Alarm.enable(led.led.on);
        led.led.currentState = false;

        vectorRefLeds.push_back(led);
    } else {
        Serial.printf_P(PSTR("%s\n"), "Компрессор не доступен для изменения состояния");
        Alarm.disable(led.led.off);
        Alarm.disable(led.led.on);
    }
}

void doserHandler(const doser& dos) {
    String message;
    message = "Включение дозатора " + dos.name;
    sendMessage(message);
    message.clear();

    switch (dos.type) {
        case K:
            doserK->begin();
            doserK->setEnableActiveState(LOW);
            doserK->move(dos.steps);
            doserK->setEnableActiveState(HIGH);
            break;
        case NP:
            doserNP->begin();
            doserNP->setEnableActiveState(LOW);
            doserNP->move(dos.steps);
            doserNP->setEnableActiveState(HIGH);
            break;
        case Fe:
            doserFe->begin();
            doserFe->setEnableActiveState(LOW);
            doserFe->move(dos.steps);
            doserFe->setEnableActiveState(HIGH);
            break;
        default:
            break;
    }
}

void splitTime(char* payload, uint8_t& hour, uint8_t& minute) {
    char* split = strtok(payload, ":");
    char* pEnd;
    hour = strtol(split, &pEnd, 10);
    split = strtok(nullptr, ":");
    minute = strtol(split, &pEnd, 10);
}

void parseJSONLights(const String& response) {
    DynamicJsonDocument doc(2000);
    DeserializationError err = deserializeJson(doc, response);
    if (err) {
        Serial.print(F("parseJSONLights -> Ошибка разбора: "));
        Serial.println(err.c_str());
        return;
    } else {
        JsonArray array = doc.as<JsonArray>();
        for (JsonObject obj : array) {
            boolean enabled = obj["enabled"];
            const char* name = obj["name"];
            const char* off = obj["off"];
            const char* on = obj["on"];
            uint8_t pin = obj["pin"];
            boolean state = obj["state"];

            char* dupOn = strdup(on);
            char* dupOff = strdup(off);
            for (auto& ledItem : leds) {
                if (strcmp(name, ledItem.name.c_str()) == 0) {
                    ledItem.led.currentState = state;
                    ledItem.led.enabled = enabled;
                    ledItem.led.pin = pin;
                    splitTime(dupOn, ledItem.led.HOn, ledItem.led.MOn);
                    splitTime(dupOff, ledItem.led.HOff, ledItem.led.MOff);

                    ledItem.led.off = Alarm.alarmRepeat(ledItem.led.HOff, ledItem.led.MOff, 0, ledOffHandler, ledItem);
                    ledItem.led.on = Alarm.alarmRepeat(ledItem.led.HOn, ledItem.led.MOn, 0, ledOnHandler, ledItem);

                    uint16_t minutes = clockRTC.getDateTime().hour * 60 + clockRTC.getDateTime().minute;
                    uint16_t minutesOn = ledItem.led.HOn * 60 + ledItem.led.MOn;
                    uint16_t minutesOff = ledItem.led.HOff * 60 + ledItem.led.MOff;
                    if ((minutes > minutesOn) && (minutes < minutesOff)) {
                        ledOnHandler(ledItem);
                    } else {
                        ledOffHandler(ledItem);
                    }
                    break;
                }
            }
            free(dupOn);
            free(dupOff);
        }
        doc.shrinkToFit();
        doc.clear();
    }
}

void parseJSONDosers(const String& response) {
    std::unique_ptr<GBasic> emptyDoser{};
    uint8_t dosersCount = (sizeof(dosersArray) / sizeof(*dosersArray));
    uint8_t ind = 0;
    DynamicJsonDocument doc(1300);
    DeserializationError err = deserializeJson(doc, response);
    if (err) {
        Serial.print(F("parseJSONDosers -> Ошибка разбора: "));
        Serial.println(err.c_str());
        return;
    } else {
        JsonArray array = doc.as<JsonArray>();
        for (JsonObject obj : array) {
            uint8_t dirPin = obj["dirPin"];
            uint8_t stepPin = obj["stepPin"];
            uint8_t enablePin = obj["enablePin"];
            uint8_t sleepPin = obj["sleepPin"];
            uint8_t mode0_pin = obj["mode0_pin"];
            uint8_t mode1_pin = obj["mode1_pin"];
            uint8_t mode2_pin = obj["mode2_pin"];

            uint8_t index = obj["index"];
            uint16_t steps = obj["steps"];
            uint16_t volume = obj["volume"];
            const char* name = obj["name"];
            const char* time = obj["time"];

            char* dupTime = strdup(time);
            for (auto& doserItem : dosersArray) {
                if (strcmp(name, doserItem.name.c_str()) == 0) {
                    for (size_t k = 0; k < dosersCount; k++) {
                        if (dosersArray[k].type == doserItem.type) {
                            ind = k;
                            k = dosersCount;
                        }
                    }

                    dosersArray[ind].dirPin = dirPin;
                    dosersArray[ind].stepPin = stepPin;
                    dosersArray[ind].enablePin = enablePin;
                    dosersArray[ind].sleepPin = sleepPin;
                    dosersArray[ind].mode0_pin = mode0_pin;
                    dosersArray[ind].mode1_pin = mode1_pin;
                    dosersArray[ind].mode2_pin = mode2_pin;

                    dosersArray[ind].index = index;
                    dosersArray[ind].steps = steps;
                    dosersArray[ind].volume = volume;

                    splitTime(dupTime, dosersArray[ind].hour, dosersArray[ind].minute);
                    emptyDoser =
                        std::make_unique<GBasic>(dosersArray[ind].steps, dosersArray[ind].dirPin, dosersArray[ind].stepPin,
                                                 dosersArray[ind].enablePin, dosersArray[ind].mode0_pin, dosersArray[ind].mode1_pin,
                                                 dosersArray[ind].mode2_pin, shiftRegister, dosersArray[ind].index);
                    switch (doserItem.type) {
                        case K:
                            doserK = std::move(emptyDoser);
                            break;
                        case NP:
                            doserNP = std::move(emptyDoser);
                            break;
                        case Fe:
                            doserFe = std::move(emptyDoser);
                            break;
                        default:
                            Serial.printf_P(PSTR("%s %s"), "Неизвестный тип дозатора", ToString(doserItem.type));
                            break;
                    }
                    dosersArray[ind].alarm =
                        Alarm.alarmRepeat(dosersArray[ind].hour, dosersArray[ind].minute, 0, doserHandler, dosersArray[ind]);
                    // TODO Селать проверку на было ли уже событие в текущем дне
                    /*
                    uint16_t minutes = clockRTC.getDateTime().hour * 60 + clockRTC.getDateTime().minute;
                    uint16_t minutesOn = led.led.HOn * 60 + led.led.MOn;
                    uint16_t minutesOff = led.led.HOff * 60 + led.led.MOff;
                    if ((minutes > minutesOn) && (minutes < minutesOff)) {
                        ledOnHandler(led);
                    } else {
                        ledOffHandler(led);
                    }
                    */
                    break;
                }
            }
            free(dupTime);
        }
        doc.shrinkToFit();
        doc.clear();
    }
}

void parseJSONCompressor(const String& response) {
    DynamicJsonDocument doc(300);
    DeserializationError err = deserializeJson(doc, response);
    if (err) {
        Serial.print(F("parseJSONCompressor -> Ошибка разбора: "));
        Serial.println(err.c_str());
        return;
    } else {
        JsonArray array = doc.as<JsonArray>();
        for (JsonObject obj : array) {
            boolean enabled = obj["enabled"];
            const char* off = obj["off"];
            const char* on = obj["on"];
            uint8_t pin = obj["pin"];
            boolean state = obj["state"];

            char* dupOn = strdup(on);
            char* dupOff = strdup(off);

            compressor.led.currentState = state;
            compressor.led.enabled = enabled;
            compressor.led.pin = pin;
            splitTime(dupOn, compressor.led.HOn, compressor.led.MOn);
            splitTime(dupOff, compressor.led.HOff, compressor.led.MOff);

            compressor.led.off = Alarm.alarmRepeat(compressor.led.HOff, compressor.led.MOff, 0, compressorOffHandler, compressor);
            compressor.led.on = Alarm.alarmRepeat(compressor.led.HOn, compressor.led.MOn, 0, compressorOnHandler, compressor);

            uint16_t minutes = clockRTC.getDateTime().hour * 60 + clockRTC.getDateTime().minute;
            uint16_t minutesOn = compressor.led.HOn * 60 + compressor.led.MOn;
            uint16_t minutesOff = compressor.led.HOff * 60 + compressor.led.MOff;

