Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
void setCurrentState(const ledDescription_t& led) {
    char* url = nullptr;
    String urlString;
    String payload;
    if (led.device == Compressor) {
        url = getPGMString(urlPutCompressor);
        urlString = String(url);
    } else {
        url = getPGMString(urlPutLight);
        urlString = String(url) + led.name + "'";
    }
    delPtr(url);
    payload = serializeDevice(led);
    if (https.begin(*client, urlString)) {
        https.addHeader(String(getPGMString(contentType)), String(getPGMString(applicationJson)));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            String name;
            (led.device == Compressor) ? name = "" : name = led.name;
            Serial.printf_P(PSTR("Состояние %s %s установлено в %s\n"), (led.device == Compressor ? "компрессора" : "прожектора "),
                            (name.c_str()), (led.led.currentState ? "ON" : "OFF"));
        } else {
            Serial.printf_P(PSTR("setCurrentState() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "setCurrentState() -> Невозможно подключиться\n");
    }
}

void putUptime(const String& uptime) {
    char* url = nullptr;
    url = getPGMString(urlPutUptime);
    if (https.begin(*client, String(url))) {
        String payload;
        payload = "{\"uptime\":\"" + uptime + "\"}";
        https.addHeader(String(getPGMString(contentType)), String(getPGMString(applicationJson)));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("putUptime() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "putUptime() -> Невозможно подключиться\n");
    }
    delPtr(url);
}

void uptime() {
    String uptime = uptime_formatter::getUptime();
    Serial.printf_P(PSTR("Время работы устройства: %s\n"), uptime.c_str());
    putUptime(uptime);
}

void putLastOnline(const String& currentTime) {
    char* url = nullptr;
    url = getPGMString(urlPutLastOnline);
    if (https.begin(*client, String(url))) {
        String payload;
        payload = "{\"lastonline\":\"" + currentTime + "\"}";
        https.addHeader(String(getPGMString(contentType)), String(getPGMString(applicationJson)));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("postLastOnline() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "postLastOnline() -> Невозможно подключиться\n");
    }
    delPtr(url);
}

void lastOnline() {
    char* currentTime = clockRTC.dateFormat("H:i:s d.m.Y", clockRTC.getDateTime());
    String payload = String(currentTime);
    putLastOnline(payload);
    free(currentTime);
}

void postBoot() {
    char* url = nullptr;
    char* currentTime = clockRTC.dateFormat("H:i:s d.m.Y", clockRTC.getDateTime());
    url = getPGMString(urlPostBoot);
    if (https.begin(*client, String(url))) {
        String payload;
        payload = "{\"time\":\"" + String(currentTime) + "\"}";
        https.addHeader(String(getPGMString(contentType)), String(getPGMString(applicationJson)));
        int httpCode = https.POST(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("postBoot() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "postBoot() -> Невозможно подключиться\n");
    }
    delPtr(url);
    String message;
    message = "Перезагрузка " + String(currentTime);
    sendMessage(message);
    message.clear();
}

void timer1() {
    char* df = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    Serial.printf_P(PSTR("Сейчас %s\n"), String(df).c_str());
    free(df);

    /*
     getTemperature();
     checkUpdateSettings();
     if (shouldUpdateFlag) {
         readOptionsFirebase();
         printAll();
         shouldUpdateFlag = false;
     }
     */
    if (!vectorRefLeds.empty()) {
        for (auto& device : vectorRefLeds) {
            setCurrentState(device);
        }
        vectorRefLeds.clear();
    }
}

void timer5() {
    uptime();
    lastOnline();
}

void startTimers() {
    Serial.printf_P(PSTR("%s -> %d\n"), "Таймеры: основные", Alarm.count());
    Alarm.timerRepeat(5 * 60, timer5);
    Alarm.timerRepeat(60, timer1);
    Serial.printf_P(PSTR("%s -> %d\n"), "Таймеры: основные и прожекторные", Alarm.count());
}

void setup() {
    Serial.begin(115200);
    Serial.println();

    //  getTemperature();
    initRealTimeClock();
    initLedsArray();
    initDosersArray();
    initCompressor();

    if (!initWiFi()) {
        getParamsEEPROM();
    } else {
        initHTTPClient();
        postBoot();
        getParamsBackEnd();
        syncTime();
        setInternalClock();
        // printAll();
    }

    startTimers();
    timer5();
}

// TODO Добавить вывод информации по устройствам
// TODO Чтение температуры
// TODO EEPROM чтение и запись

void loop() {
    Alarm.delay(10);
}